HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/flash_types/flash_mx/r_flash_spi_type_sub.h
/***********************************************************************************************************************
* Copyright (c) 2014 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_flash_spi_type_sub.h
* Version      : 3.51
* Description  : FLASH SPI driver memory type header file
***********************************************************************************************************************/
/***********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 23.07.2014 2.21    Created
*              : 29.05.2015 2.32    Revised functions of same as Ver.2.32 of EEPROM SPI FIT module.
*              : 31.12.2021 3.03    Added variable "read_after_write" "read_after_write_add" and
*                                   "read_after_write_data" for controlling SPI bus.
*              : 16.03.2023 3.20    Added support for QSPIX Memory Mapped Mode.
*              : 15.11.2023 3.40    Added support for MX25U6432F.
*                                   Added features Advanced sector protection supporting for MX66L1G45 and MX25U6432F.
*              : 15.03.2025 3.51    Updated disclaimer.
***********************************************************************************************************************/
#ifndef FLASH_SPI_TYPE_SUB_H
#define FLASH_SPI_TYPE_SUB_H


/************************************************************************************************
Includes <System Includes> , "Project Includes"
*************************************************************************************************/


/************************************************************************************************
Macro definitions
*************************************************************************************************/
/*-------- Definitions of Command size ---------*/
#define FLASH_SPI_MX_CMD_SIZE           (uint8_t)(1)    /* Command size(Byte)                       */
#define FLASH_SPI_MX_STSREG_SIZE        (uint32_t)(1)   /* Status register size(Byte)               */
#define FLASH_SPI_MX_SCURREG_SIZE       (uint32_t)(1)   /* Security register size (bytes)           */
#define FLASH_SPI_MX_LKREG_SIZE         (uint32_t)(2)   /* Lock register size (2 bytes)             */
#define FLASH_SPI_MX_SPBLKREG_SIZE      (uint32_t)(1)   /* SPB lock register size (1 byte)          */
#define FLASH_SPI_MX_SPBREG_SIZE        (uint32_t)(1)   /* SPB register size (1 byte)               */
#if   (FLASH_SPI_CFG_DEV0_MX25L == 1) || (FLASH_SPI_CFG_DEV0_MX66L == 1) || (FLASH_SPI_CFG_DEV0_MX25U == 1) || \
      (FLASH_SPI_CFG_DEV1_MX25L == 1) || (FLASH_SPI_CFG_DEV1_MX66L == 1) || (FLASH_SPI_CFG_DEV1_MX25U == 1)
#define FLASH_SPI_MX_CFGREG_SIZE        (uint32_t)(1)   /* Configuration register size (1 byte)     */
#define FLASH_SPI_MX_WSTSREG_SIZE       (uint32_t)(2)   /* Status register size (bytes) for Write   */
#elif (FLASH_SPI_CFG_DEV0_MX25R == 1) || (FLASH_SPI_CFG_DEV1_MX25R == 1)
#define FLASH_SPI_MX_CFGREG_SIZE        (uint32_t)(2)   /* Configuration register size (2 bytes)    */
#define FLASH_SPI_MX_WSTSREG_SIZE       (uint32_t)(3)   /* Status register size (bytes) for Write   */
#endif
#define FLASH_SPI_MX_IDDATA_SIZE        (uint32_t)(3)   /* ID data size (bytes)                     */
#define TRUE                            (bool)(true)    /* not close SPI bus cycle                  */
#define FALSE                           (bool)(false)   /* close SPI bus cycle                      */

/*-------- Definitions of device information ---------*/
/* ==== FLASH device 0 ==== */
#if (FLASH_SPI_CFG_DEV0_MX25L == 1) && (FLASH_SPI_CFG_DEV0_SIZE_32M == 1)
#define FLASH_SPI_MX_DEV0_MEM_SIZE      (uint32_t)(4194304)     /* 4MByte (32Mbit)                      */
#define FLASH_SPI_MX_DEV0_SECT_ADDR     (uint32_t)(0xfffff000)  /* Sector address setting               */
#define FLASH_SPI_MX_DEV0_B32K_ADDR     (uint32_t)(0xffff8000)  /* 32KB Block address setting           */
#define FLASH_SPI_MX_DEV0_B64K_ADDR     (uint32_t)(0xffff0000)  /* 64KB Block address setting           */
#define FLASH_SPI_MX_DEV0_PAGE_SIZE     (uint32_t)(256)         /* Page size when writing               */
#define FLASH_SPI_MX_DEV0_ADDR_SIZE     FLASH_SPI_ADDR_3BYTES   /* Address size (bytes)                 */
#define FLASH_SPI_MX_DEV0_WP_WHOLE_MEM  (uint8_t)(0x0f)         /* Whole memory WP setting              */
#define FLASH_SPI_MX_DEV0_FULL_CHIP_ERASE   FLASH_SPI_MODE_C_ERASE
                                            /* Kind of full-chip erase command that the device supports */
#define FLASH_SPI_MX_DEV0_ADDR_MODE     FLASH_SPI_MODE_3BYTE    /* Addressability Mode                  */
#define FLASH_SPI_DEV0_TYPE             FLASH_SPI_TYPE_MX25L    /* Flash memory type                    */
#endif  /* (FLASH_SPI_CFG_DEV0_MX25L == 1) && (FLASH_SPI_CFG_DEV0_SIZE_32M == 1) */

#if (FLASH_SPI_CFG_DEV0_MX25L == 1) && (FLASH_SPI_CFG_DEV0_SIZE_64M == 1)
#define FLASH_SPI_MX_DEV0_MEM_SIZE      (uint32_t)(8388608)     /* 8MByte (64Mbit)                      */
#define FLASH_SPI_MX_DEV0_SECT_ADDR     (uint32_t)(0xfffff000)  /* Sector address setting               */
#define FLASH_SPI_MX_DEV0_B32K_ADDR     (uint32_t)(0xffff8000)  /* 32KB Block address setting           */
#define FLASH_SPI_MX_DEV0_B64K_ADDR     (uint32_t)(0xffff0000)  /* 64KB Block address setting           */
#define FLASH_SPI_MX_DEV0_PAGE_SIZE     (uint32_t)(256)         /* Page size when writing               */
#define FLASH_SPI_MX_DEV0_ADDR_SIZE     FLASH_SPI_ADDR_3BYTES   /* Address size (bytes)                 */
#define FLASH_SPI_MX_DEV0_WP_WHOLE_MEM  (uint8_t)(0x0f)         /* Whole memory WP setting              */
#define FLASH_SPI_MX_DEV0_FULL_CHIP_ERASE   FLASH_SPI_MODE_C_ERASE
                                            /* Kind of full-chip erase command that the device supports */
#define FLASH_SPI_MX_DEV0_ADDR_MODE     FLASH_SPI_MODE_3BYTE    /* Addressability Mode                  */
#define FLASH_SPI_DEV0_TYPE             FLASH_SPI_TYPE_MX25L    /* Flash memory type                    */
#endif  /* (FLASH_SPI_CFG_DEV0_MX25L == 1) && (FLASH_SPI_CFG_DEV0_SIZE_64M == 1) */

#if (FLASH_SPI_CFG_DEV0_MX25L == 1) && (FLASH_SPI_CFG_DEV0_SIZE_128M == 1)
#define FLASH_SPI_MX_DEV0_MEM_SIZE      (uint32_t)(16777216)    /* 16MByte (128Mbit)                    */
#define FLASH_SPI_MX_DEV0_SECT_ADDR     (uint32_t)(0xfffff000)  /* Sector address setting               */
#define FLASH_SPI_MX_DEV0_B32K_ADDR     (uint32_t)(0xffff8000)  /* 32KB Block address setting           */
#define FLASH_SPI_MX_DEV0_B64K_ADDR     (uint32_t)(0xffff0000)  /* 64KB Block address setting           */
#define FLASH_SPI_MX_DEV0_PAGE_SIZE     (uint32_t)(256)         /* Page size when writing               */
#define FLASH_SPI_MX_DEV0_ADDR_SIZE     FLASH_SPI_ADDR_3BYTES   /* Address size (bytes)                 */
#define FLASH_SPI_MX_DEV0_WP_WHOLE_MEM  (uint8_t)(0x0f)         /* Whole memory WP setting              */
#define FLASH_SPI_MX_DEV0_FULL_CHIP_ERASE   FLASH_SPI_MODE_C_ERASE
                                            /* Kind of full-chip erase command that the device supports */
#define FLASH_SPI_MX_DEV0_ADDR_MODE     FLASH_SPI_MODE_3BYTE    /* Addressability Mode                  */
#define FLASH_SPI_DEV0_TYPE             FLASH_SPI_TYPE_MX25L    /* Flash memory type                    */
#endif  /* (FLASH_SPI_CFG_DEV0_MX25L == 1) && (FLASH_SPI_CFG_DEV0_SIZE_128M == 1) */

#if (FLASH_SPI_CFG_DEV0_MX25L == 1) && (FLASH_SPI_CFG_DEV0_SIZE_256M == 1)
#define FLASH_SPI_MX_DEV0_MEM_SIZE      (uint32_t)(33554432)    /* 32MByte (256Mbit)                    */
#define FLASH_SPI_MX_DEV0_SECT_ADDR     (uint32_t)(0xfffff000)  /* Sector address setting               */
#define FLASH_SPI_MX_DEV0_B32K_ADDR     (uint32_t)(0xffff8000)  /* 32KB Block address setting           */
#define FLASH_SPI_MX_DEV0_B64K_ADDR     (uint32_t)(0xffff0000)  /* 64KB Block address setting           */
#define FLASH_SPI_MX_DEV0_PAGE_SIZE     (uint32_t)(256)         /* Page size when writing               */
#define FLASH_SPI_MX_DEV0_ADDR_SIZE     FLASH_SPI_ADDR_4BYTES   /* Address size (bytes)                 */
#define FLASH_SPI_MX_DEV0_WP_WHOLE_MEM  (uint8_t)(0x0f)         /* Whole memory WP setting              */
#define FLASH_SPI_MX_DEV0_FULL_CHIP_ERASE   FLASH_SPI_MODE_C_ERASE
                                            /* Kind of full-chip erase command that the device supports */
#define FLASH_SPI_MX_DEV0_ADDR_MODE     FLASH_SPI_MODE_4BYTE    /* Addressability Mode                  */
#define FLASH_SPI_DEV0_TYPE             FLASH_SPI_TYPE_MX25L    /* Flash memory type                    */
#endif  /* (FLASH_SPI_CFG_DEV0_MX25L == 1) && (FLASH_SPI_CFG_DEV0_SIZE_256M == 1) */

#if (FLASH_SPI_CFG_DEV0_MX66L == 1) && (FLASH_SPI_CFG_DEV0_SIZE_512M == 1)
#define FLASH_SPI_MX_DEV0_MEM_SIZE      (uint32_t)(67108864)    /* 64MByte (512Mbit)                    */
#define FLASH_SPI_MX_DEV0_SECT_ADDR     (uint32_t)(0xfffff000)  /* Sector address setting               */
#define FLASH_SPI_MX_DEV0_B32K_ADDR     (uint32_t)(0xffff8000)  /* 32KB Block address setting           */
#define FLASH_SPI_MX_DEV0_B64K_ADDR     (uint32_t)(0xffff0000)  /* 64KB Block address setting           */
#define FLASH_SPI_MX_DEV0_PAGE_SIZE     (uint32_t)(256)         /* Page size when writing               */
#define FLASH_SPI_MX_DEV0_ADDR_SIZE     FLASH_SPI_ADDR_4BYTES   /* Address size (bytes)                 */
#define FLASH_SPI_MX_DEV0_WP_WHOLE_MEM  (uint8_t)(0x0f)         /* Whole memory WP setting              */
#define FLASH_SPI_MX_DEV0_FULL_CHIP_ERASE   FLASH_SPI_MODE_C_ERASE
                                            /* Kind of full-chip erase command that the device supports */
#define FLASH_SPI_MX_DEV0_ADDR_MODE     FLASH_SPI_MODE_4BYTE    /* Addressability Mode                  */
#define FLASH_SPI_DEV0_TYPE             FLASH_SPI_TYPE_MX66L    /* Flash memory type                    */
#endif  /* (FLASH_SPI_CFG_DEV0_MX66L == 1) && (FLASH_SPI_CFG_DEV0_SIZE_512M == 1) */

#if (FLASH_SPI_CFG_DEV0_MX25L == 1) && (FLASH_SPI_CFG_DEV0_SIZE_512M == 1)
#define FLASH_SPI_MX_DEV0_MEM_SIZE      (uint32_t)(67108864)    /* 64MByte (512Mbit)                    */
#define FLASH_SPI_MX_DEV0_SECT_ADDR     (uint32_t)(0xfffff000)  /* Sector address setting               */
#define FLASH_SPI_MX_DEV0_B32K_ADDR     (uint32_t)(0xffff8000)  /* 32KB Block address setting           */
#define FLASH_SPI_MX_DEV0_B64K_ADDR     (uint32_t)(0xffff0000)  /* 64KB Block address setting           */
#define FLASH_SPI_MX_DEV0_PAGE_SIZE     (uint32_t)(256)         /* Page size when writing               */
#define FLASH_SPI_MX_DEV0_ADDR_SIZE     FLASH_SPI_ADDR_4BYTES   /* Address size (bytes)                 */
#define FLASH_SPI_MX_DEV0_WP_WHOLE_MEM  (uint8_t)(0x0f)         /* Whole memory WP setting              */
#define FLASH_SPI_MX_DEV0_FULL_CHIP_ERASE   FLASH_SPI_MODE_C_ERASE
                                            /* Kind of full-chip erase command that the device supports */
#define FLASH_SPI_MX_DEV0_ADDR_MODE     FLASH_SPI_MODE_4BYTE    /* Addressability Mode                  */
#define FLASH_SPI_DEV0_TYPE             FLASH_SPI_TYPE_MX25L    /* Flash memory type                    */
#endif  /* (FLASH_SPI_CFG_DEV0_MX25L == 1) && (FLASH_SPI_CFG_DEV0_SIZE_512M == 1) */

#if (FLASH_SPI_CFG_DEV0_MX66L == 1) && (FLASH_SPI_CFG_DEV0_SIZE_1G == 1)
#define FLASH_SPI_MX_DEV0_MEM_SIZE      (uint32_t)(134217728)   /* 128MByte (1Gbit)                     */
#define FLASH_SPI_MX_DEV0_SECT_ADDR     (uint32_t)(0xfffff000)  /* Sector address setting               */
#define FLASH_SPI_MX_DEV0_B32K_ADDR     (uint32_t)(0xffff8000)  /* 32KB Block address setting           */
#define FLASH_SPI_MX_DEV0_B64K_ADDR     (uint32_t)(0xffff0000)  /* 64KB Block address setting           */
#define FLASH_SPI_MX_DEV0_PAGE_SIZE     (uint32_t)(256)         /* Page size when writing               */
#define FLASH_SPI_MX_DEV0_ADDR_SIZE     FLASH_SPI_ADDR_4BYTES   /* Address size (bytes)                 */
#define FLASH_SPI_MX_DEV0_WP_WHOLE_MEM  (uint8_t)(0x0f)         /* Whole memory WP setting              */
#define FLASH_SPI_MX_DEV0_FULL_CHIP_ERASE   FLASH_SPI_MODE_C_ERASE
                                            /* Kind of full-chip erase command that the device supports */
#define FLASH_SPI_MX_DEV0_ADDR_MODE     FLASH_SPI_MODE_4BYTE    /* Addressability Mode                  */
#define FLASH_SPI_DEV0_TYPE             FLASH_SPI_TYPE_MX66L    /* Flash memory type                    */
#endif  /* (FLASH_SPI_CFG_DEV0_MX66L == 1) && (FLASH_SPI_CFG_DEV0_SIZE_1G == 1) */

